app/Services/UserService.php

SELECT *
FROM `users`
---
    public function getAllUsers()
    {
        # code...
         return $this->users->findAll();